#+TITLE: PROMICE Level 0 Manual (L0M) log


* 2020-fall / kdm

Fall 2020 - KDM rebuilds (and builds) PROMICE AWS Processing (PAP) toolchain. Documented in [[file:~/projects/GEUS-PROMICE/PROMICE-AWS-processing/README.org]]

+ Copy L0 to L0M: L0/EGP_2016_raw.txt -> L0M/EGP-2016-raw.txt
+ Build L0M/EGP/template.hdr from metadata/EGP_metadata.csv
+ Repeat for other files

** EGP files all have headers that can be re-used and appear the same in EGP_metadata.csv, except 2019-TX

Here are the fields, names, and units used in 2016-raw.txt, and other EGP files:

#+BEGIN_SRC bash :results verbatim :output results 
grep -E "fields =|standard_name =|long_name =|units =|scale_factor =|add_offset =" ./EGP/EGP-2016-raw.txt | datamash -t, transpose|cat -n
#+END_SRC

#+RESULTS:
#+begin_example
     1	# fields = time,# standard_name = time,# long_name = Time,# units = yyyy-mm-dd HH:MM:SS,# scale_factor = 1,# add_offset = 0
     2	 rec, record, Record, , 1, 0
     3	 min_y, minutes, Minutes in year, min, 1, 0
     4	 p, air_pressure, Air pressure, hPa, 0.01, 0
     5	 t_1, air_temperature, Air temperature 1, C, 1, 273.15
     6	 t_2, air_temperature, Air temperature 2, C, 1, 273.15
     7	 rh, relative_humidity, Relative humidity, %, 1, 0
     8	 wspd, wind_speed, Wind speed, m s-1, 1, 0
     9	 wdir, wind_from_direction, Wind from direction, degrees, 1, 0
    10	 wd_std, wind_from_direction_standard_deviation, Wind from direction (standard deviation), degrees, 1, 0
    11	 dsr, surface_downwelling_shortwave_flux, Downwelling shortwave radiation, W m-2, 1, 0
    12	 usr, surface_upwelling_shortwave_flux, Upwelling shortwave radiation, W m-2, 1, 0
    13	 dlr, surface_downwelling_longwave_flux, Downwelling longwave radiation, W m-2, 1, 0
    14	 ulr, surface_upwelling_longwave_flux, Upwelling longwave radiation, W m-2, 1, 0
    15	 t_rad, temperature_of_radiation_sensor, Radiation sensor temperature, C, 1, 273.15
    16	 z_boom, distance_to_surface_from_boom, Boom height, m, 1, 0
    17	 z_boom_q, distance_to_surface_from_boom_quality, Boom height (quality), , 1, 0
    18	 z_stake, distance_to_surface_from_stake_assembly, Stake height, m, 1, 0
    19	 z_stake_q, distance_to_surface_from_stake_assembly_quality, Stake height (quality), , 1, 0
    20	 z_pt, depth_of_pressure_transducer_in_ice, Depth of pressure transducer in ice , m, 1, 0
    21	 t_i_1, ice_temperature_at_t1, Ice temperature at sensor 1, C, 1, 273.15
    22	 t_i_2, ice_temperature_at_t2, Ice temperature at sensor 2, C, 1, 273.15
    23	 t_i_3, ice_temperature_at_t3, Ice temperature at sensor 3, C, 1, 273.15
    24	 t_i_4, ice_temperature_at_t4, Ice temperature at sensor 4, C, 1, 273.15
    25	 t_i_5, ice_temperature_at_t5, Ice temperature at sensor 5, C, 1, 273.15
    26	 t_i_6, ice_temperature_at_t6, Ice temperature at sensor 6, C, 1, 273.15
    27	 t_i_7, ice_temperature_at_t7, Ice temperature at sensor 7, C, 1, 273.15
    28	 t_i_8, ice_temperature_at_t8, Ice temperature at sensor 8, C, 1, 273.15
    29	 tilt_x, platform_view_angle_x, Tilt to east, degrees, 0.0174533, 0
    30	 tilt_y, platform_view_angle_y, Tilt to north, degrees, 0.0174533, 0
    31	 gps_time, gps_time, GPS time, s, 1, 0
    32	 gps_lat, gps_latitude, Latitude, degrees, 1, 0
    33	 gps_lon, gps_longitude, Longitude, degrees, 1, 0
    34	 gps_alt, gps_altitude, Altitude, m, 1, 0
    35	 gps_geoid, gps_geoid_separation, Height of EGM96 geoid over WGS84 ellipsoid, m, 1, 0
    36	 gps_geounit, gps_geounit, GeoUnit, , 1, 0
    37	 gps_q, gps_q, Quality, , 1, 0
    38	 gps_numsat, gps_numsat, GPS number of satellites, , 1, 0
    39	 gps_hdop, gps_hdop, GPS horizontal dillution of preciosion (HDOP), m, 1, 0
    40	 t_log, temperature_of_logger, Logger temperature, C, 1, 273.15
    41	 fan_dc, fan_current, Fan current, mA, 1000, 0
    42	 batt_v_ss, battery_voltage_at_sample_start, Battery voltage (sample start), V, 1, 0
    43	 batt_v, battery_voltage, Battery voltage, V, 1, 0
#+end_example

The above matches [[file:~/projects/GEUS-PROMICE/PROMICE-AWS-processing/AWS_data_PROMICE.orig/metadata/EGP_metadata.csv]] - 43 columns, and the data appear to match the units and names.

However, the EGP_metadata.csv says 2019-tx has 38 columns but provides headers for 33 of them.

1) Copy-and-paste the information above into the <<HEREDOC below
2) Delete line numbers after carefully checking with the metadata.csv file
3) Eval this section
4) Copy-and-paste results into the NEAD header, with some minor manual re-formatting

#+BEGIN_SRC bash :results verbatim
cat <<EOF | cut -c7- | datamash -t, transpose
     1	# fields = time,# standard_name = time,# long_name = Time,# units = yyyy-mm-dd HH:MM:SS,# scale_factor = 1,# add_offset = 0
     2	 rec, record, Record, , 1, 0
     4	 p, air_pressure, Air pressure, hPa, 0.01, 0
     5	 t_1, air_temperature, Air temperature 1, C, 1, 273.15
     6	 t_2, air_temperature, Air temperature 2, C, 1, 273.15
     7	 rh, relative_humidity, Relative humidity, %, 1, 0
     8	 wspd, wind_speed, Wind speed, m s-1, 1, 0
     9	 wdir, wind_from_direction, Wind from direction, degrees, 1, 0
    11	 dsr, surface_downwelling_shortwave_flux, Downwelling shortwave radiation, W m-2, 1, 0
    12	 usr, surface_upwelling_shortwave_flux, Upwelling shortwave radiation, W m-2, 1, 0
    13	 dlr, surface_downwelling_longwave_flux, Downwelling longwave radiation, W m-2, 1, 0
    14	 ulr, surface_upwelling_longwave_flux, Upwelling longwave radiation, W m-2, 1, 0
    15	 t_rad, temperature_of_radiation_sensor, Radiation sensor temperature, C, 1, 273.15
    16	 z_boom, distance_to_surface_from_boom, Boom height, m, 1, 0
    18	 z_stake, distance_to_surface_from_stake_assembly, Stake height, m, 1, 0
    20	 z_pt, depth_of_pressure_transducer_in_ice, Depth of pressure transducer in ice , m, 1, 0
    21	 t_i_1, ice_temperature_at_t1, Ice temperature at sensor 1, C, 1, 273.15
    22	 t_i_2, ice_temperature_at_t2, Ice temperature at sensor 2, C, 1, 273.15
    23	 t_i_3, ice_temperature_at_t3, Ice temperature at sensor 3, C, 1, 273.15
    24	 t_i_4, ice_temperature_at_t4, Ice temperature at sensor 4, C, 1, 273.15
    25	 t_i_5, ice_temperature_at_t5, Ice temperature at sensor 5, C, 1, 273.15
    26	 t_i_6, ice_temperature_at_t6, Ice temperature at sensor 6, C, 1, 273.15
    27	 t_i_7, ice_temperature_at_t7, Ice temperature at sensor 7, C, 1, 273.15
    28	 t_i_8, ice_temperature_at_t8, Ice temperature at sensor 8, C, 1, 273.15
    29	 tilt_x, platform_view_angle_x, Tilt to east, degrees, 0.0174533, 0
    30	 tilt_y, platform_view_angle_y, Tilt to north, degrees, 0.0174533, 0
    31	 gps_time, gps_time, GPS time, s, 1, 0
    32	 gps_lat, gps_latitude, Latitude, degrees, 1, 0
    33	 gps_lon, gps_longitude, Longitude, degrees, 1, 0
    34	 gps_alt, gps_altitude, Altitude, m, 1, 0
    39	 gps_hdop, gps_hdop, GPS horizontal dillution of preciosion (HDOP), m, 1, 0
    41	 fan_dc, fan_current, Fan current, mA, 1000, 0
    43	 batt_v, battery_voltage, Battery voltage, V, 1, 0
EOF
#+END_SRC

#+RESULTS:
: 	# fields = time,	 rec,	 p,	 t_1,	 t_2,	 rh,	 wspd,	 wdir,	 dsr,	 usr,	 dlr,	 ulr,	 t_rad,	 z_boom,	 z_stake,	 z_pt,	 t_i_1,	 t_i_2,	 t_i_3,	 t_i_4,	 t_i_5,	 t_i_6,	 t_i_7,	 t_i_8,	 tilt_x,	 tilt_y,	 gps_time,	 gps_lat,	 gps_lon,	 gps_alt,	 gps_hdop,	 fan_dc,	 batt_v
: # standard_name = time, record, air_pressure, air_temperature, air_temperature, relative_humidity, wind_speed, wind_from_direction, surface_downwelling_shortwave_flux, surface_upwelling_shortwave_flux, surface_downwelling_longwave_flux, surface_upwelling_longwave_flux, temperature_of_radiation_sensor, distance_to_surface_from_boom, distance_to_surface_from_stake_assembly, depth_of_pressure_transducer_in_ice, ice_temperature_at_t1, ice_temperature_at_t2, ice_temperature_at_t3, ice_temperature_at_t4, ice_temperature_at_t5, ice_temperature_at_t6, ice_temperature_at_t7, ice_temperature_at_t8, platform_view_angle_x, platform_view_angle_y, gps_time, gps_latitude, gps_longitude, gps_altitude, gps_hdop, fan_current, battery_voltage
: # long_name = Time, Record, Air pressure, Air temperature 1, Air temperature 2, Relative humidity, Wind speed, Wind from direction, Downwelling shortwave radiation, Upwelling shortwave radiation, Downwelling longwave radiation, Upwelling longwave radiation, Radiation sensor temperature, Boom height, Stake height, Depth of pressure transducer in ice , Ice temperature at sensor 1, Ice temperature at sensor 2, Ice temperature at sensor 3, Ice temperature at sensor 4, Ice temperature at sensor 5, Ice temperature at sensor 6, Ice temperature at sensor 7, Ice temperature at sensor 8, Tilt to east, Tilt to north, GPS time, Latitude, Longitude, Altitude, GPS horizontal dillution of preciosion (HDOP), Fan current, Battery voltage
: # units = yyyy-mm-dd HH:MM:SS, , hPa, C, C, %, m s-1, degrees, W m-2, W m-2, W m-2, W m-2, C, m, m, m, C, C, C, C, C, C, C, C, degrees, degrees, s, degrees, degrees, m, m, mA, V
: # scale_factor = 1, 1, 0.01, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0.0174533, 0.0174533, 1, 1, 1, 1, 1, 1000, 1
: # add_offset = 0, 0, 0, 273.15, 273.15, 0, 0, 0, 0, 0, 0, 0, 273.15, 0, 0, 0, 273.15, 273.15, 273.15, 273.15, 273.15, 273.15, 273.15, 273.15, 0, 0, 0, 0, 0, 0, 0, 0, 0

Then, cut-and-paste that back into the NEAD header



